cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Crustless Mushroom Spinach Pie
:PROPERTIES:
:export_file_name: crustless-mushroom-spinach-pie
:export_hugo_custom_front_matter: :servings 6 servings
:export_hugo_custom_front_matter+: :prep-time 10 minutes
:export_hugo_custom_front_matter+: :cook-time 1 hour
:export_hugo_custom_front_matter+: :ready-in 1 hour 10 minutes
:export_hugo_custom_front_matter+: :source-url https://www.sugarfreemom.com/recipes/crustless-mushroom-spinach-pie/
:END:
*** Ingredients

- 8 ounces mushrooms
- 1 teaspoon minced garlic
- 2 teaspoon olive oil
- 10 ounce frozen spinach
- 2 tablespoons grated parmesan
- 4 eggs
- 16 ounces cottage cheese 4%
- 1/2 cup heavy cream
- 1 teaspoon salt
- 1/2 teaspoon pepper
- 1/4 teaspoon nutmeg
- 1/2 cup shredded mozzarella

*** Directions

1. Preheat oven to 350 degrees.
2. Thaw frozen spinach and drain, squeeze out as much water as possible. Set aside.
3. Thinly slice mushrooms.
4. Heat oil and garlic in a large skillet. Add mushrooms and cook until tender.
5. Add spinach to mushrooms and salt, pepper and nutmeg cook until spinach is heated through.
6. Drain spinach/mushroom mixture in a colander.
7. Grease a 9 inch pie plate then sprinkle parmesan all around to coat plate.
8. In a bowl, whisk eggs then add cream and cottage cheese and stir well.
9. Stir in mushrooms and spinach mixture.
10. Pour into pie dish. Sprinkle with mozzarella.
11. Place pie dish on a baking sheet and cook for 50-60 minutes or until set in center and browned around edges.
12. Turn oven off and allow to sit in oven for 10 minutes.
13. Stand 10 more minutes before slicing.

