content/recipe/crustless-mushroom-spinach-pie.md
---
title: "Crustless Mushroom Spinach Pie"
author: ["Trev"]
date: 2018-03-02T00:00:00-08:00
tags: ["GF"]
categories: ["entree"]
draft: false
servings: "6 servings"
prep-time: "10 minutes"
cook-time: "1 hour"
ready-in: "1 hour 10 minutes"
source-url: "https://www.sugarfreemom.com/recipes/crustless-mushroom-spinach-pie/"
---

## Ingredients {#ingredients}

-   8 ounces mushrooms
-   1 teaspoon minced garlic
-   2 teaspoon olive oil
-   10 ounce frozen spinach
-   2 tablespoons grated parmesan
-   4 eggs
-   16 ounces cottage cheese 4%
-   1/2 cup heavy cream
-   1 teaspoon salt
-   1/2 teaspoon pepper
-   1/4 teaspoon nutmeg
-   1/2 cup shredded mozzarella


## Directions {#directions}

1.  Preheat oven to 350 degrees.
2.  Thaw frozen spinach and drain, squeeze out as much water as possible. Set aside.
3.  Thinly slice mushrooms.
4.  Heat oil and garlic in a large skillet. Add mushrooms and cook until tender.
5.  Add spinach to mushrooms and salt, pepper and nutmeg cook until spinach is heated through.
6.  Drain spinach/mushroom mixture in a colander.
7.  Grease a 9 inch pie plate then sprinkle parmesan all around to coat plate.
8.  In a bowl, whisk eggs then add cream and cottage cheese and stir well.
9.  Stir in mushrooms and spinach mixture.
10. Pour into pie dish. Sprinkle with mozzarella.
11. Place pie dish on a baking sheet and cook for 50-60 minutes or until set in center and browned around edges.
12. Turn oven off and allow to sit in oven for 10 minutes.
13. Stand 10 more minutes before slicing.